<a href="https://colab.research.google.com/github/iceman67/-Python/blob/master/LINC_Pandas_Example_2021.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Pandas** 설치하기 
> pip install pandas

Pandas 는 정형화된 데이터를 다루기에 적합하다

Pandas에서 제공하는 2개의 자료구조인 시리즈(Series)과 데이터프레임(DataFrame)을 이해한다

* Series는 엑셀에서 한개 열(column)과 같는 1차원 리스트와 같은 구조임

In [1]:
import pandas as pd # pandas 패키지를 pd라는 이름으로 사용한다

In [2]:
series = pd.Series([1, 1, 3, 4, 5])
# 왼쪽에는 Series의 인덱스(index)를, 오른쪽은 값(value)를 제공한다
series

0    1
1    1
2    3
3    4
4    5
dtype: int64

In [3]:
# values는 값을 출력함
series.values

array([1, 1, 3, 4, 5])

In [4]:
# Index를 출력함
series.index

RangeIndex(start=0, stop=5, step=1)

 특정값의 개수를 출력한다(빈도수를 얻기 위해 사용함)

In [ ]:
series.value_counts()

1    2
5    1
4    1
3    1
dtype: int64

Series 에서 특정값을 접근함

In [ ]:
# [  ] 안에 조건식을 사용할 수 이다
series[series > 2]

2    3
3    4
4    5
dtype: int64

In [ ]:
# 인덱스를 이용해 값을 제거할수도 있다
series = series.drop(0)
series

1    1
2    3
3    4
4    5
dtype: int64

In [ ]:
# append 함수를 이용하여 값을 추가할수도 있어요. 이때 값은 Series 형태의 값만 추가가 가능합니다
series = series.append(pd.Series([6, 7]))
series

1    1
2    3
3    4
4    5
0    6
1    7
dtype: int64

In [ ]:
# 값을 추가하니 인덱스 조정이 필요하며  reindex 함수를 통해 재정의할 수 있다
series = series.reset_index(drop=True)
series

0    1
1    3
2    4
3    5
4    6
5    7
dtype: int64

In [ ]:
series[1]=100

In [ ]:
import matplotlib.pyplot as plt
series.plot(kind='pie')
plt.show()

* Series가 엑셀에서 한개 줄을 말한다면 DataFrame은 표 형태의 값이며, 
> Series가 여러개 모이면 Dataframe이 구성됨

In [ ]:
# DataFrame은 마치 사전과 같은 형태로 초기화한다
dataframe = pd.DataFrame({'힘':[1, 2, 3], '지력':[-2 ,3 ,4], '마력': [2, 1, 0]})
dataframe

   힘  지력  마력
0  1  -2   2
1  2   3   1
2  3   4   0

In [ ]:
# 데이터프레임을 슬라이싱함 
dataframe[:2]

   힘  지력  마력
0  1  -2   2
1  2   3   1

In [ ]:
# 인덱스 0과 2의 행을 얻어옴
dataframe.loc[[0,2]]

   힘  지력  마력
0  1  -2   2
2  3   4   0

In [ ]:
dataframe.loc[[0,2], ['힘']]

   힘
0  1
2  3

In [ ]:
# axis를 0으로 설정하면 특정행(row)를 제거할 수 있다.
dataframe.drop(0, axis=0)

   힘  지력  마력
1  2   3   1
2  3   4   0

In [ ]:
# axis를 1으로 설정하면 열(column)를 제거할 수 있다
dataframe.drop("마력", axis=1)

   힘  지력
0  1  -2
1  2   3
2  3   4

데이터셋(dataset) 의 자료를 읽어 분석을 수행한다.
> 자료 https://www.kaggle.com/c/titanic

* 데이터분석을 통해 데이터가 갖는 특성을 파악함
* 분석을 통해 예측모델 개발에 활용할 수 있음

In [6]:
titanic_df = pd.read_csv('train.csv')

In [7]:
# Sibsp 형재자매/배우자 수
# Parch 부모/자녀 수
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
titanic_df.shape

(891, 12)

In [9]:
# 데이터에 대한 기본정보 확인
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
titanic_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [12]:
titanic_df = pd.read_csv('train.csv', index_col='PassengerId')
titanic_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
# 값이 없는 데이터 항목 및 수향 확인 
titanic_df.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [14]:
value_counts = titanic_df['Pclass'].value_counts()

인덱싱을 통해 시리즈(Series)로 추출함

In [15]:
print(type(value_counts))

<class 'pandas.core.series.Series'>

* 조건값을 마스크로 구성함

> Age가 10 보다 크거나 같고 20보다 작은 것을 마스크 구성함 

> Age가 10 보다 작고 female 로 마스크 구성함

In [19]:
mask1 = (titanic_df["Age"] >= 10) & (titanic_df["Age"] < 20)
df_teenage = titanic_df.loc[mask1,:]
print(df_teenage.head())

             Survived  Pclass                                  Name     Sex  \
PassengerId
10                  1       2   Nasser, Mrs. Nicholas (Adele Achem)  female
15                  0       3  Vestrom, Miss. Hulda Amanda Adolfina  female
23                  1       3           McGowan, Miss. Anna "Annie"  female
28                  0       1        Fortune, Mr. Charles Alexander    male
39                  0       3    Vander Planke, Miss. Augusta Maria  female

              Age  SibSp  Parch  Ticket      Fare        Cabin Embarked
PassengerId
10           14.0      1      0  237736   30.0708          NaN        C
15           14.0      0      0  350406    7.8542          NaN        S
23           15.0      0      0  330923    8.0292          NaN        Q
28           19.0      3      2   19950  263.0000  C23 C25 C27        S
39           18.0      2      0  345764   18.0000          NaN        S

In [21]:
mask2 = (titanic_df.Age < 10) & (titanic_df.Sex == 'female')
df_female_under10 = titanic_df.loc[mask2, :]
print(df_female_under10.head())

             Survived  Pclass                                      Name  \
PassengerId
11                  1       3           Sandstrom, Miss. Marguerite Rut
25                  0       3             Palsson, Miss. Torborg Danira
44                  1       2  Laroche, Miss. Simonne Marie Anne Andree
59                  1       2              West, Miss. Constance Mirium
120                 0       3         Andersson, Miss. Ellis Anna Maria

                Sex  Age  SibSp  Parch         Ticket     Fare Cabin Embarked
PassengerId
11           female  4.0      1      1        PP 9549  16.7000    G6        S
25           female  8.0      3      1         349909  21.0750   NaN        S
44           female  3.0      1      2  SC/Paris 2123  41.5792   NaN        C
59           female  5.0      1      2     C.A. 34651  27.7500   NaN        S
120          female  2.0      4      2         347082  31.2750   NaN        S

# 1등, 2등, 3등석 승객수
print(value_counts)

Embarked (승선지)

In [20]:
titanic_df[["Embarked", "Sex"]].nunique()

Embarked    3
Sex         2
dtype: int64

In [ ]:
titanic_df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [ ]:
titanic_df["Embarked"] = titanic_df["Embarked"].astype("category")
titanic_df["Embarked"].dtype

CategoricalDtype(categories=['C', 'Q', 'S'], ordered=False)

In [ ]:
# 새로 생성된 'Age_0' 열의 모든 값은 0 으로 채워진다
titanic_df['Age_0'] = 0

In [ ]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [ ]:
titanic_drop_df = titanic_df.drop('Age_0', axis=1)

In [ ]:
titanic_drop_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
titanic_df = pd.read_csv('train.csv')

In [ ]:
indexes = titanic_df.index

In [ ]:
print (indexes)

RangeIndex(start=0, stop=891, step=1)

In [ ]:
indexes.values

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
       156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
       169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181,
       182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194,
       195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207,
       208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220,
       221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233,
       234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246,
       247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259,
       260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272,
       273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285,
       286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298,
       299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311,
       312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324,
       325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337,
       338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350,
       351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363,
       364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376,
       377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389,
       390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402,
       403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415,
       416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428,
       429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441,
       442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454,
       455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467,
       468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480,
       481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493,
       494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506,
       507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519,
       520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532,
       533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545,
       546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558,
       559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571,
       572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584,
       585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597,
       598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610,
       611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623,
       624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636,
       637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649,
       650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662,
       663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675,
       676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688,
       689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, 700, 701,
       702, 703, 704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714,
       715, 716, 717, 718, 719, 720, 721, 722, 723, 724, 725, 726, 727,
       728, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740,
       741, 742, 743, 744, 745, 746, 747, 748, 749, 750, 751, 752, 753,
       754, 755, 756, 757, 758, 759, 760, 761, 762, 763, 764, 765, 766,
       767, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779,
       780, 781, 782, 783, 784, 785, 786, 787, 788, 789, 790, 791, 792,
       793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805,
       806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818,
       819, 820, 821, 822, 823, 824, 825, 826, 827, 828, 829, 830, 831,
       832, 833, 834, 835, 836, 837, 838, 839, 840, 841, 842, 843, 844,
       845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855, 856, 857,
       858, 859, 860, 861, 862, 863, 864, 865, 866, 867, 868, 869, 870,
       871, 872, 873, 874, 875, 876, 877, 878, 879, 880, 881, 882, 883,
       884, 885, 886, 887, 888, 889, 890], dtype=int64)

In [ ]:
indexes[:5].values

array([0, 1, 2, 3, 4], dtype=int64)

In [ ]:
titanic_sorted = titanic_df.sort_values(by = ['Name'])

In [ ]:
titanic_sorted.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S

In [ ]:
titanic_sorted = titanic_df.sort_values(by = ['Pclass','Name'])

In [ ]:
titanic_sorted.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
730,731,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S

In [ ]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [ ]:
titanic_df[ ['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [ ]:
titanic_df['Embarked(Humanized)'] = titanic_df['Embarked'].replace('C', 'Cherbourg').replace('S', 'Southhampton').replace('Q', 'Queenstown')

In [ ]:
titanic_df.iloc[1:3]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Embarked(Humanized)
PassengerId,,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cherbourg
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Southhampton

In [ ]:
titanic_df.loc[1:3, ['Name', 'Sex']]

                                                          Name     Sex
PassengerId
1                                      Braund, Mr. Owen Harris    male
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female
3                                       Heikkinen, Miss. Laina  female